;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL Calibrate Software
ID1022=Project collection
ID1023=Sel.:
ID1007=SaveAs
ID1017=Del.
ID1084=Import
ID1085=Export

ID1075=Head
ID1024=Base
ID1025=Cali.Range(mm):
ID1026=Mark.Range(mm):
ID1072=Coord.
ID1077=R.Angle
ID1079=Off.X(mm)
ID1080=Off.Y(mm)

ID1030=Level Cali.
ID1009=New Level
ID1010=Del.Level
ID1012=Test All
ID1031=TestLayer:

ID1053=Red Cali.
ID1043=Used
ID1054=X Scale:
ID1055=Y Scale:
ID1056=X Offset(mm):
ID1057=Y Offset(mm):

ID1058=Focus
ID1065=Mirror Type:
ID1059=Type
ID1060=Ctrl Mode
ID1061=Mirr Dist(mm)
ID1082=Dist between head && worktable(mm)
ID1063=MicroAdjust(um)
ID1062=AutoFocus ratio

ID1011=Test F7
ID1037=Stop
ID1014=Para>>

ID1109=Cali Type
ID1099=Normal Cali
ID1100=Super Cali 1
ID1101=Super Cali 2
ID1110= Normal calibrate, adjust axis and box size
ID1114=Import CaliData

ID1089=Super Cali
ID1086=Mark Matrix
ID1111=First step: Mark Matrix
ID1112=Second step: Get cali data by scanner
ID1113=Third step: Import cali data and make super cali file

ID1096=Scale
ID1027=Effective mark range
ID1097=Concave
ID1028=Test Box range(mm):
ID1091=Import Data from scnner
ID1087=Import Data from vision measurement system 
ID1016=Make super cali file
ID1=Ok
ID2=Cancel

[CALISET_DLG_167]
CAPTION=Import super cali data
ID1114=The file of X position：
ID1115=The file of Y position：
ID1=Ok
ID2=Cancel

[CALISET_DLG_159]
CAPTION=Save project
ID1036=The name of project is:
ID1=Ok
ID2=Cancel

[CALISET_DLG_131]
CAPTION=Marking Para
ID1032=Mark count:
ID1033=Mark V.(mm/s)
ID1034=Q Frequent(KHz)
ID1035=PowerCurrent
ID1036=Q Release(us)
ID1=Ok
ID2=Cancel

[CALISET_DLG_160]
CAPTION=Set matrix mark
ID1093=Row
ID1094=Col
ID1116=Only Set
ID1=Ok
ID2=Cancel

[CALISET_DLG_164]
CAPTION=Select control card
ID1098=Please select working card:
ID1=Ok
ID2=Cancel

[CALISET_STRINGTABLE]
ID0=BOX size(mm)
ID1=X zoom%
ID2=Y zoom%
ID3=X conca
ID4=Y conca
ID5=X trape
ID6=Y trape
ID7=X paral
ID8=Y paral
ID9=X+ rate%
ID10=X- rate%
ID11=Y+ rate%
ID12=Y- rate%
ID13=Para\Level
ID14=Current(A)
ID15=Power(%)
ID16=Current(%)
ID999=Marking softwar or calibrate has been start. Please close it first!
ID1000=Marking library file is missing or damaged, please make sure the software is proper!
ID1001=Initialize control board unsuccessfully!
ID1002=configuration of Marking control board is unsuccessful!
ID1003=Please select the level to be tested!
ID1004=Operation failed, retry!
ID1005=Existed project, overwrited?	
ID1006=Calibration range mustn't be zero0!	
ID1007=Marking range mustn't be zero!
ID1008=Wrong coefficient of proportionality, calibration range must bigger than %.3f times of marking!
ID1009=Apply
ID1010=Edit
ID1011=Please select the level to be deleted!
ID1012=Delete unsuccessfully! Please remain one level at least.
ID1013=File error!
ID1014=Set the calibration data to the card unsuccessfully, retry!!	
ID1015=Version is not consistent. Begin a mandatory read?
ID1016=BOX size overstep mark range!
ID1017=BOX size can not overstep upper pole size!
ID1018=The current calibration settings have been modified.Save it?
ID1019=Read file unsuccessfully!
ID1020=Are you sure to delete this project?
ID1021=No softdog found!
ID1022=Softdog found, but it's invalid!
ID1023=More than 1 valid softdog inserted!
ID1024=Failed to convert initial softdog into running softdog!
ID1025="Software license expired. Please contact customer service personnel of Han's Laser to re-apply licensed patches matching (softdog ID=%s, check code=%s)."
ID1026="D160"
ID1027="D480"
ID1028="CO2_Strong"
ID1029="CO2_Tradition"
ID1030="Mark faily!"
ID1031=BOX size can not be less than next pole size!
ID1032=Out of valid calibration range!
ID1033="f-thea Back"
ID1034="Front"
ID1035="Normal Back"
ID1036="BOX size must be less than value of mark range subtract %d mm while general laser mode"
ID1037="Fail to get the DOG ID saving on the card. Please check whether card has been binded"
ID1038="Fail to Import"
ID1039="Import successfully"
ID1040="Fail to Export"
ID1041="Export successfully"
ID1042="Operate unsuccessfully"
ID1043="File mismatch,error file!"
ID1044="SCAN_254"

;---------------------------------End: EMCC\Caliset-----------------------------------------

;---------------------------------BEGIN: EMCC\ADJUSTM-----------------------------------------
[ADJUSTM_STRINGTABLE]
ID1000= It doesn't need adjust M, because you have selected classic control mode.
ID1001=MarkSpeed(mm/s)
ID1002=JumpSpeed(mm/s)
ID1003=Q Frequent(KHz)
ID1004=Q Release(us)
ID1005=Power(%)
ID1006=Current(A)
ID1007=Power(%)
ID1008=Current(%)
ID1009=Laser mode/Wave mode
ID1010=SimmerCurrent(%)

[ADJUSTM_DLG_102]
ID1025 = Welcome to use AdjustM Software!
ID1026 = Please complete these steps below:
ID1027 = First  Step:  Calibrate box
ID1028 = Second Step:  Calibrate repeat fill
ID1029 = Third  Step:  Integration test
ID1004 = NEXT
ID2 = Cancel

[ADJUSTM_DLG_129]
ID1027 = First  Step:  Calibrate box
ID1030 = Please mark a 10*10 box and ajust the M until the state of normarl picture drawing.
ID1031 = Normarl:
ID1032 = M big:
ID1033 = M small:
ID1034 = Mark Para.
ID1035 = M Cali.
ID1036 = M Value
ID1037 = M Rate
ID1004 = NEXT
ID1 = Ok
ID2 = Cancel

[ADJUSTM_DLG_133]
ID1028 = Second Step:  Calibrate repeat fill
ID1038 = Marking five filling line with repeating fill mode. It use the last Adjusted M. Please continue to ajust M fine until the normarl state drawing by normal pictrue.
ID1039 = Effect
ID1031 = Normarl
ID1032 = M big
ID1033 = M small
ID1035 = M Cali.
ID1036 = M Value
ID1037 = M Rate
ID1004 = NEXT
ID1 = Ok
ID2 = Cancel


[ADJUSTM_DLG_137]
ID1029 = Third  Step:  Integration test
ID1040 = Marking the box and fill line at the same time. Please check whether effect is Ok. If not, adjust M right along.
ID1041 = Mark Graph
ID1031 = Normarl
ID1032 = M big
ID1033 = M small
ID1035 = M Cali.
ID1036 = M Value
ID1037 = M Rate
ID1 = Ok
ID2 = Cancel

;---------------------------------End: EMCC\ADJUSTM-----------------------------------------